import styles from "./Tnc.module.css"

const TncCN = () => {
  return (
        <div className={styles.tncParent}>
      <ol>
        <li>
          此活动仅适用于所有【M88明陞】会员。
          <table>
            <thead>
              <tr>
                <th>活动期间   （GMT+8)</th>
              </tr>
            </thead>
            <tbody>
              <tr>
                <td>2025 年 10 ⽉ 13 ⽇ 00:00 – 2025 年 12 ⽉ 31 ⽇ 23:59</td>
              </tr>
            </tbody>
          </table>
        </li>

        <li>
          活动期间，会员在真人娱乐场游戏中进行投注，并根据最高流水，有机会赢取专属奖品，详情如下：
          <table>
            <thead>
              <tr>
                <th rowSpan={2}>排名</th>
                <th rowSpan={2}>奖励</th>
              </tr>
              <tr></tr>
            </thead>
            <tbody>
              <tr>
                <td>1</td>
                <td>大奖：700,000 元</td>
              </tr>
              <tr>
                <td>2 - 6</td>
                <td>
                  摩纳哥·夏日奢华假期套装<br />
                  · 往返商务舱机票<br />
                  · 豪华五星级酒店 6 天 5 夜住宿
                </td>
              </tr>
              <tr>
                <td>7 - 10</td>
                <td>100 克黄金条</td>
              </tr>
              <tr>
                <td>11 - 30</td>
                <td>75 克黄金条</td>
              </tr>
              <tr>
                <td>31 - 50</td>
                <td>50 克黄金条</td>
              </tr>
              <tr>
                <td>51 - 106</td>
                <td>25 克黄金条</td>
              </tr>
            </tbody>
          </table>
          <br />
          **奖品不可兑换为免费彩金。
          <br />
          **旅游奖项不可转让。
          <br />
          **第 2 至第 6 名将获得前往摩纳哥夏日假期的双人全额赞助行程。
          <br />
          **行程包含：
          <br />
          - 从获奖者所在国家出发的 往返商务舱机票 2 张
          <br />
          - 6 天 5 夜五星级酒店住宿
          <br />
          - 机场与酒店之间的接送服务（往返）
          <br />
          <br />
          获奖者需自行办理前往摩纳哥的签证，M88 不承担任何签证办理费用与相关责任。
          <br />
          排名将于每周 星期二下午 2 点（GMT+8） 更新
          <br />
          点击此处查看您的当前排名。
        </li>

        <li>
          会员登录后需点击  <strong>"选择参加" </strong> 按钮并在优惠截止前提交。该优惠每位会员仅限领取一次，并仅在活动期间内有效。
        </li>

        <li>
          仅计算真钱投注，所有平局 / 退款 / 拒绝 / 作废 / 取消的投注、对投、对所排除的项目列表中游戏投注将不包括在有效合格投注和 / 或流水要求的计算中（如适用）。
        </li>

        <li>
          如果排行榜上有两位或以上的会员得分相同，则先达到该分数的会员将在排行榜上获得较高排名。
        </li>

        <li>
          活动结束后，我们的客服团队将在接下来的 5 天内联系第 2 名至第 106 名的获奖会员，安排奖品发放事宜。若会员无法联系，则视为自动放弃奖品。
        </li>

        <li>
          终极大奖将于活动结束后的 5 天内发放至会员的钱包账户中。
        </li>

        <li>
          所有额外产生的个人支出费用（如适用，也包括同行宾客的费用）将由获奖者自行承担。
        </li>

        <li>
          一般条款及规则应用于此优惠。
        </li>


      </ol>
    </div>
  )
}

export default TncCN